package employeeService.employeeBook;

import employeeService.employeeBook.model.Employee;

import java.util.HashMap;
import java.util.Map;

public class DepartmentServiceTestConstants {
    public static final Map<String, Employee> VOID_MAP = new HashMap<>();
    public static final Map<String, Employee> NORMAL_MAP = new HashMap<>(
            Map.of(
                    "Кисложопкин Аркадий Васильевич",
                    new Employee("Кисложопкин", "Аркадий", "Васильевич", "1", 35000),
                    "Селиванов Акакий Александрович",
                    new Employee("Селиванов", "Акакий", "Александрович", "2", 32000),
                    "Селиванова Акакия Александровна",
                    new Employee("Селиванова", "Акакия", "Александровна", "2", 32000),
                    "Кулиджи Казимир Космосович",
                    new Employee("Кулиджи", "Казимир", "Космосович", "3", 42000),
                    "Франклин Бенджамин Батькович",
                    new Employee("Франклин", "Бенджамин", "Батькович", "4", 200_000),
                    "Джугашвили Иосиф Виссарионович",
                    new Employee("Джугашвили", "Иосиф", "Виссарионович", "5", 1_000),
                    "Хирохито Сёма Ёсихитович",
                    new Employee("Хирохито", "Сёма", "Ёсихитович", "4", 100_000)
            ));
    public static final Map<String, Employee> VOID_SECOND_DEP_MAP = new HashMap<>(
            Map.of(
                    "Кисложопкин Аркадий Васильевич",
                    new Employee("Кисложопкин", "Аркадий", "Васильевич", "1", 35000),
                    "Селиванов Акакий Александрович",
                    new Employee("Селиванов", "Акакий", "Александрович", "1", 32000),
                    "Кулиджи Казимир Космосович",
                    new Employee("Кулиджи", "Казимир", "Космосович", "3", 42000),
                    "Франклин Бенджамин Батькович",
                    new Employee("Франклин", "Бенджамин", "Батькович", "4", 200_000),
                    "Джугашвили Иосиф Виссарионович",
                    new Employee("Джугашвили", "Иосиф", "Виссарионович", "5", 1_000),
                    "Хирохито Сёма Ёсихитович",
                    new Employee("Хирохито", "Сёма", "Ёсихитович", "4", 100_000)
            ));
    public static final Map<String, Employee> ONLY_SECOND_DEP_IS_FULL_MAP = new HashMap<>(
            Map.of(
                    "Кисложопкин Аркадий Васильевич",
                    new Employee("Кисложопкин", "Аркадий", "Васильевич", "2", 35000),
                    "Селиванов Акакий Александрович",
                    new Employee("Селиванов", "Акакий", "Александрович", "2", 32000),
                    "Кулиджи Казимир Космосович",
                    new Employee("Кулиджи", "Казимир", "Космосович", "2", 42000),
                    "Франклин Бенджамин Батькович",
                    new Employee("Франклин", "Бенджамин", "Батькович", "2", 200_000),
                    "Джугашвили Иосиф Виссарионович",
                    new Employee("Джугашвили", "Иосиф", "Виссарионович", "2", 1_000),
                    "Хирохито Сёма Ёсихитович",
                    new Employee("Хирохито", "Сёма", "Ёсихитович", "2", 100_000)
            ));
}
